<?php

return [
    // Navbar & Menu
    'home'         => 'Бош саҳифа',
    'download'     => 'Юклаб олиш',
    'promos'       => 'Акциялар',
    'benefit'      => 'Фойдаланувчилар учун',
    'portfolio'    => 'Лойиҳалар',
    'for_sponsors' => 'Ҳомийларимиз учун',
    'sponsors'     => 'Ҳомийлар',
    'about'        => 'Биз ҳақимизда',

    // Footer
    'pages'        => 'Саҳифалар',
    'contacts'     => 'Алоқа маълумотлари',
    'privacy'      => 'Махфийлик сиёсати',
    'terms'        => 'Оммавий оферта',
    'support'      => 'Қўллаб-қувватлаш',

    // Download section
    'download_googleplay_small' => 'Get it on',
    'download_googleplay'       => 'Google Play',
    'download_appstore_small'   => 'Download from',
    'download_appstore'         => 'App Store',
    'download_telegram_small'   => 'Join us on',
    'download_telegram'         => 'Telegram',

    // Promos
    'promo_subtitle' => 'Қатнашим ва ютуб олинг!',
    'promo_title'    => 'Фаол акциялар',

    // Benefit
    'benefit_subtitle' => 'Нега айнан PromoBank?',
    'benefit_title'    => 'Мижозларимиз учун имкониятлар',

    // Portfolio
    'portfolio_subtitle' => 'Бизнинг лойиҳаларимиз?',
    'portfolio_title'    => 'Бизнинг муваффақиятли лойиҳаларимиз',

    // For Sponsors
    'for_sponsors_subtitle' => 'Ҳомийларимиз учун',
    'for_sponsors_title'    => 'Биз ҳомийларимизга қуйидагиларни таклиф қиламиз',

    // Sponsors
    'sponsors_subtitle' => 'Бизнинг ҳомийларимиз?',
    'sponsors_title'    => 'Биз хизмат кўрсатган брендлар',

    // About section
    'about_subtitle' => 'Биз ҳақимизда',
    'about_title'    => 'PromoBank ҳақида',


    'start' => 'Бошланиш:',
    'end' => 'Тугаш:',
    'offer' => 'Оферта билан танишинг',
    'methods' => 'Қатнашиш усуллари',
    'telegram' => 'Телеграм бот орқали',
    'sms' => 'SMS орқали қатнашиш',
    'mobile' => 'Мобил иловадан',
    'gallery' => 'Промоаксия медиа галереяси',
    'extra' => 'Қўшимча маълумотлар',
    'sms_title' => 'SMS орқали қатнашиш',
    'sms_text' => 'Промокодни <strong>:phone</strong> қисқа рақамига юборинг.',
    'close' => 'Ёпиш',
    'download_title' => 'Мобил иловани юклаб олинг',
    'download_desc' => 'PromoBank мобил илова ва Телеграм бот орқали барча акцияларда қатнашинг.',

    // Scanner Modal
    'scanner_title' => 'QR кодни сканерлаш',
    'scanner_hint' => 'QR кодни камерага тутинг',
    'scanner_cancel' => 'Бекор қилиш',
    'scanner_submit' => 'Юбориш',

    // Receipt Modal
    'receipt_title' => 'Ҳарид чекини сканерлаш',
    'receipt_hint' => "QR кодни камерага тутинг. Ва совғалар ҳамда промобалларга эга бўлинг.",

    // Code Modal
    'code_title' => 'Промокодни киритинг',
    'code_placeholder' => 'Кодни киритинг...',

    'secret_number_placeholder' => 'Сирли рақамни киритинг..',
    'ball_text' => 'балл',
    'today' => 'Бугун',
    'top_100' => 'ТОП 100 Рейтинг',
    // :time ni olib tashlamang
    'daily_refresh' => 'Рейтинг ҳар куни :time да янгиланади',
    'rating_title'=>"🎯 Рейтинг TOP 100",
   'read_offer' => 'Ўқиш',
    'no_offer' => 'Мавжуд эмас',
];
