<?php
namespace App\Telegram\Services;

use Illuminate\Support\Facades\Cache;

class Translator
{
    protected array $messages = [
        'ask_birthdate'            => [
            'uz' => "📅 Tug‘ilgan sanangizni YYYY-MM-DD formatida yuboring (masalan, 1998-07-15)",
            'ru' => "📅 Пожалуйста, отправьте дату рождения в формате ГГГГ-ММ-ДД (например, 1998-07-15)",
            'kr' => "📅 Туғилган санаингизни YYYY-MM-DD форматида юборинг (масалан, 1998-07-15)",
        ],
        'invalid_birthdate_format' => [
            'uz' => "❌ Noto‘g‘ri format. Tug‘ilgan sanani YYYY-MM-DD tarzida yuboring.",
            'ru' => "❌ Неверный формат. Пожалуйста, отправьте дату рождения в формате ГГГГ-ММ-ДД.",
            'kr' => "❌ Нотўғри формат. Илтимос, туғилган санани YYYY-MM-DD кўринишида юборинг.",
        ],
        'birthdate_received'       => [
            'uz' => "✅ Tug‘ilgan sana qabul qilindi. Ro‘yxatga olish yakunlandi.",
            'ru' => "✅ Дата рождения принята. Регистрация завершена.",
            'kr' => "✅ Туғилган сана қабул қилинди. Рўйхатдан ўтиш якунланди.",
        ],
        'ask_district'             => [
            'uz' => "🏘 Iltimos, yashayotgan tumaningizni ro‘yxatdan tanlang.",
            'ru' => "🏘 Пожалуйста, выберите свой район проживания из списка.",
            'kr' => "🏘 Илтимос, яшаб турган тумангизни рўйхатдан танланг.",
        ],
        'invalid_region_choice'    => [
            'uz' => "❌ Noto‘g‘ri tanlov. Iltimos, ro‘yxatdan hududni tanlang.",
            'ru' => "❌ Неверный выбор. Пожалуйста, выберите регион из списка.",
            'kr' => "❌ Нотўғри танлов. Илтимос, рўйхатдан ҳудудни танланг.",
        ],
        'region_list_failed'       => [
            'uz' => "❌ Hududlar ro'yxatini olishda xatolik yuz berdi. Iltimos, keyinroq urinib ko'ring.",
            'ru' => "❌ Произошла ошибка при получении списка регионов. Пожалуйста, попробуйте позже.",
            'kr' => "❌ Ҳудудлар рўйхатини олишда хатолик юз берди. Илтимос, кейинроқ уриниб кўринг.",
        ],
        'ask_phone'                => [
            'uz' => "📱 Iltimos, ro'yhatdan o'tish uchun telefon raqamingizni yuboring",
            'ru' => "📱 Пожалуйста, отправьте свой номер телефона для регистрации",
            'kr' => "📱 Илтимос, рўйхатдан ўтиш учун телефон рақамингизни юборинг",
        ],
        'already_registered'       => [
            'uz' => "✅ Siz muvaffaqiyatli ro'yxatdan o'tgansiz.",
            'ru' => "✅ Вы успешно зарегистрированы.",
            'kr' => "✅ Сиз муваффақиятли рўйхатдан ўтдингиз.",
        ],
        'ask_region'               => [
            'uz' => "📍 Iltimos, yashash hududingizni tanlang.",
            'ru' => "📍 Пожалуйста, выберите ваш регион.",
            'kr' => "📍 Илтимос, яшаш ҳудудингизни танланг.",
        ],
        'share_phone_button'       => [
            'uz' => '📱 Raqamni yuborish',
            'ru' => '📱 Отправить номер',
            'kr' => '📱 Рақамни юбориш',
        ],
        'welcome'                  => [
            'uz' => 'Promobankga xush kelibsiz',
            'ru' => ' Ruscha: Добро пожаловать в Промобанк',
            'kr' => 'Промобанкка хуш келибсиз',
        ],
        'ask_phone2'               => [
            'uz' => "📞 Ixtiyoriy qo‘shimcha telefon raqam kiriting yoki O'tqazib yuboring.",
            'ru' => "📞 Дополнительный номер (необязательно) или нажмите Далее.",
            'kr' => "📞 Ихтиёрий қўшимча телефон рақамини киритинг ёки ўтказиб юборинг.",
        ],
        'next'                     => [
            'uz' => 'O‘tkazib yuborish',
            'ru' => 'Пропустить',
            'kr' => 'Ўтказиб юбориш',
        ],
        'ask_gender'               => [
            'uz' => "👫 Iltimos, jinsingizni tanlang",
            'ru' => "👫 Пожалуйста, выберите ваш пол",
            'kr' => "👫 Илтимос, жинсингизни танланг",
        ],
        'invalid_gender'           => [
            'uz' => "❗ Iltimos, tugmalardan birini tanlang:",
            'ru' => "❗ Пожалуйста, выберите один из предложенных вариантов:",
            'kr' => "❗ Илтимос, берилган тугмалардан бирини танланг:",
        ],
        'gender_male'              => [
            'uz' => '👨 Erkak',
            'ru' => '👨 Мужчина',
            'kr' => '👨 Эркак',
        ],
        'gender_female'            => [
            'uz' => '👩 Ayol',
            'ru' => '👩 Женщина',
            'kr' => '👩 Аёл',
        ],
        'phone_received'           => [
            'uz' => "📱 Raqam qabul qilindi. Iltimos, davom eting.",
            'ru' => "📱 Номер получен. Пожалуйста, продолжайте.",
            'kr' => "📱 Рақам қабул қилинди. Илтимос, давом этинг.",
        ],
        'invalid_phone2_format'    => [
            'uz' => "📵 Noto‘g‘ri format. Iltimos, telefon raqamni +998901234567 tarzida yuboring.",
            'ru' => "📵 Неверный формат. Пожалуйста, отправьте номер в формате +998901234567.",
            'kr' => "📵 Нотўғри формат. Илтимос, телефон рақамни +998901234567 шаклида юборинг.",
        ],
        'only_contact_allowed'     => [
            'uz' => "❗️Iltimos, faqat telefon raqamingizni ulashing. Boshqa xabar yuborish mumkin emas.",
            'ru' => "❗️Пожалуйста, отправьте только номер телефона. Отправка других сообщений запрещена.",
            'kr' => "❗️Илтимос, фақат телефон рақамингизни юборинг. Бошқа хабарларни юбориш мумкин эмас.",
        ],
        'gender_received'          => [
            'uz' => "✅ Jins muvaffaqiyatli tanlandi. Iltimos, davom eting.",
            'ru' => "✅ Пол успешно выбран. Пожалуйста, продолжайте.",
            'kr' => "✅ Жинс муваффақиятли танланди. Илтимос, давом этинг.",
        ],
    ];

    public function get($chatId, $key)
    {
        $lang = Cache::store('redis')->get("tg_lang:$chatId", 'uz');
        return $this->messages[$key][$lang] ?? $this->messages[$key]['uz'];
    }
}