<?php
namespace App\Telegram\Services;

use Illuminate\Support\Facades\Cache;

class Translator
{
    protected array $messages = [
        'start'                    => [
            'uz' => "Assalomu alaykum, Promobank platformasining Telegramdagi rasmiy botiga xush kelibsiz!",
            'ru' => "Здравствуйте, добро пожаловать в официальный бот платформы Promobank в Telegram!",
            'kr' => "Ассалому алайкум, Promobank платформасининг Telegramдаги расмий ботига хуш келибсиз!",
        ],
        'welcome'                  => [
            'uz' => "🎉 Promobank platformasiga xush kelibsiz! Endilikda siz bu platformadagi barcha loyihalarda qatnasha olasiz.",
            'ru' => "🎉 Добро пожаловать на платформу Promobank! Теперь вы можете участвовать во всех проектах на этой платформе.",
            'kr' => "🎉 Промобанк платформасига хуш келибсиз! Энди сиз ушбу платформадаги барча лойиҳаларда қатнашишингиз мумкин.",
        ],
        "ask_name"                 => [
            'uz' => "📋 Iltimos, ro'yxatdan o'tish uchun familiya va ismingizni kiriting: Namuna: Abdullayev Abdulla",
            'ru' => "📋 Пожалуйста, введите вашу фамилию и имя для регистрации: Пример: Иванов Иван",
            'kr' => "📋 Илтимос, рўйхатдан ўтиш учун фамилия ва исмингизни киритинг: Намуна: Абдуллаев Абдулла",
        ],
        'invalid_name_format'      => [
            'uz' => "❌ Noto‘g‘ri format. Iltimos, faqat harflardan iborat bo‘lgan va kamida 3 ta belgi kiriting.",
            'ru' => "❌ Неверный формат. Пожалуйста, введите только буквы и минимум 3 символа.",
            'kr' => "❌ Нотўғри формат. Илтимос, фақат ҳарфлардан иборат бўлган ва камида 3 та белгидан иборат бўлган матн киритинг.",
        ],
        'name_received'            => [
            'uz' => "✅ Ismingiz qabul qilindi.",
            'ru' => "✅ Ваше имя принято.",
            'kr' => "✅ Исмингиз қабул қилинди.",
        ],
        'ask_phone'                => [
            'uz' => "📱 Telefon raqamingizni quyidagi tugmani bosish orqali yuboring",
            'ru' => "📱 Отправьте ваш номер телефона, нажав на кнопку ниже",
            'kr' => "📱 Телефон рақамингизни қуйидаги тугмани босиш орқали юборинг",
        ],
        'share_phone_button'       => [
            'uz' => '📱 Raqamni yuborish',
            'ru' => '📱 Отправить номер',
            'kr' => '📱 Рақамни юбориш',
        ],
        'invalid_phone_format'     => [
            'uz' => "❗️Iltimos, faqat telefon raqamingizni quyidagi tugmani bosish orqali biz ulashing.",
            'ru' => "❗️Пожалуйста, отправьте только номер телефона, нажав на кнопку ниже.",
            'kr' => "❗️Илтимос, фақат телефон рақамингизни қуйидаги тугмани босиш орқали юборинг.",
        ],

        'phone_received'           => [
            'uz' => "📱 Telefon raqam qabul qilindi.",
            'ru' => "📱 Ваш номер телефона принят.",
            'kr' => "📱 Телефон рақамингиз қабул қилинди.",
        ],

        'already_registered'       => [
            'uz' => "✅ Siz bizning Promobank platformamizda avval ro'yxatdan o'tganligingiz tufayli registratsiya jarayoni muvaffaqiyatli yakunlandi.",
            'ru' => "✅ Так как вы уже зарегистрированы на нашей платформе Promobank, процесс регистрации успешно завершён.",
            'kr' => "✅ Сиз Promobank платформамизда аввал рўйхатдан ўтганингиз сабабли рўйхатдан ўтиш жараёни муваффақиятли якунланди.",
        ],

        'ask_phone2'               => [
            'uz' => "📱 Biz siz bilan bog‘lanishimiz uchun qo‘shimcha telefon raqamini kiriting yoki bu bosqichni o'tkazib yuboring.",
            'ru' => "📱 Пожалуйста, введите дополнительный номер телефона, чтобы мы могли связаться с вами, или пропустите этот шаг.",
            'kr' => "📱 Биз сиз билан боғланишимиз учун қўшимча телефон рақамини киритинг ёки ушбу босқични ўтказиб юборинг.",
        ],
        'invalid_phone2_format'    => [
            'uz' => "❗️Noto‘g‘ri format kiritildi. Iltimos, telefon raqamni +998901234567 tarzida yuboring.",
            'ru' => "❗️Неверный формат. Пожалуйста, отправьте номер телефона в формате +998901234567.",
            'kr' => "❗️Нотўғри формат киритилди. Илтимос, телефон рақамни +998901234567 кўринишида юборинг.",
        ],
        'phone2_received'          => [
            'uz' => "✅ Qo'shimcha  raqam qabul qilindi.",
            'ru' => "✅ Дополнительный номер принят.",
            'kr' => "✅ Қўшимча рақам қабул қилинди.",
        ],
        'ask_gender'               => [
            'uz' => "👫 Iltimos, jinsingizni tanlang",
            'ru' => "👫 Пожалуйста, выберите ваш пол",
            'kr' => "👫 Илтимос, жинсингизни танланг",
        ],
        'gender_male'              => [
            'uz' => '👨 Erkak',
            'ru' => '👨 Мужчина',
            'kr' => '👨 Эркак',
        ],
        'gender_female'            => [
            'uz' => '👩 Ayol',
            'ru' => '👩 Женщина',
            'kr' => '👩 Аёл',
        ],
        'invalid_gender_format'    => [
            'uz' => "❗ Iltimos, tugmalardan birini tanlang:",
            'ru' => "❗ Пожалуйста, выберите один из предложенных вариантов:",
            'kr' => "❗ Илтимос, берилган тугмалардан бирини танланг:",
        ],

        'gender_received'          => [
            'uz' => "✅ Jins muvaffaqiyatli tanlandi.",
            'ru' => "✅ Пол успешно выбран.",
            'kr' => "✅ Жинс муваффақиятли танланди.",
        ],
        'ask_region'               => [
            'uz' => "📍 Iltimos, yashash hududingizni belgilang.",
            'ru' => "📍 Пожалуйста, укажите регион вашего проживания.",
            'kr' => "📍 Илтимос, яшаш ҳудудингизни белгиланг.",
        ],
        'invalid_region_format'    => [
            'uz' => "❌ Noto‘g‘ri tanlov. Iltimos, ro‘yxatdan hududni tanlang.",
            'ru' => "❌ Неверный выбор. Пожалуйста, выберите регион из списка.",
            'kr' => "❌ Нотўғри танлов. Илтимос, рўйхатдан ҳудудни танланг.",
        ],
        'region_received'          => [
            'uz' => "✅ Hudud muvaffaqiyatli tanlandi.",
            'ru' => "✅ Регион успешно выбран.",
            'kr' => "✅ Ҳудуд муваффақиятли танланди.",
        ],
        'ask_district'             => [
            'uz' => "🏘 Iltimos, o'z yashash shahringiz yoki tumaningizni belgilang.",
            'ru' => "🏘 Пожалуйста, укажите ваш город или район проживания.",
            'kr' => "🏘 Илтимос, ўз яшаш шаҳриингиз ёки туманиингизни белгиланг.",
        ],
        'invalid_district_format'  => [
            'uz' => "❌ Noto‘g‘ri tanlov. Iltimos, ro‘yxatdan shahar yoki tumanni tanlang.",
            'ru' => "❌ Неверный выбор. Пожалуйста, выберите город или район из списка.",
            'kr' => "❌ Нотўғри танлов. Илтимос, рўйхатдан шаҳар ёки тумани танланг.",
        ],
        'district_received'        => [
            'uz' => "✅ Shahar yoki tuman muvaffaqiyatli tanlandi.",
            'ru' => "✅ Город или район успешно выбран.",
            'kr' => "✅ Шаҳар ёки туман муваффақиятли танланди.",
        ],
        'ask_birthdate'            => [
            'uz' => "📅 Tug‘ilgan sanangizni kun.oy.yil formatida yuboring (masalan, 31.12.2000)",
            'ru' => "📅 Отправьте дату своего рождения в формате день.месяц.год (например, 31.12.2000)",
            'kr' => "📅 Туғилган санаингизни кун.ой.йил форматда юборинг (масалан, 31.12.2000)",
        ],

        'invalid_birthdate_format' => [
            'uz' => "❗️Noto‘g‘ri format kiritildi. Iltimos, Tug‘ilgan sanangizni kun.oy.yil formatida yuboring. Namuna: 31.12.2000",
            'ru' => "❗️Неверный формат. Пожалуйста, отправьте дату рождения в формате день.месяц.год. Пример: 31.12.2000",
            'kr' => "❗️Нотўғри формат киритилди. Илтимос, туғилган санаингизни кун.ой.йил форматда юборинг. Намуна: 31.12.2000",
        ],
        'birthdate_received'       => [
            'uz' => "✅ Tug‘ilgan sana qabul qilindi.",
            'ru' => "✅ Дата рождения принята.",
            'kr' => "✅ Туғилган сана қабул қилинди.",
        ],
        'ask_offer'                => [
            'uz' => '📄 Loyiha ofertasi bilan tanishib chiqing',
            'ru' => '📄 Ознакомьтесь с офертой проекта',
            'kr' => '📄 Лойиҳа офертаси билан танишиб чиқинг',
        ],
        'invalid_offer_format'     => [
            'uz' => "❗️ Iltimos, quyidagi tugmani bosing.",
            'ru' => "❗️ Пожалуйста, нажмите на кнопку ниже.",
            'kr' => "❗️ Илтимос, қуйидаги тугмани босинг.",
        ],
        'offer_received'           => [
            'uz' => "✅ Offertaga rozilik bildirildi.",
            'ru' => "✅ Вы согласились с офертой.",
            'kr' => "✅ Лойиҳа офертига розилик билдирилди.",
        ],
        'offer_button'             => [
            'uz' => '📄 Oferta',
            'ru' => '📄 Оферта',
            'kr' => '📄 Оферта',
        ],

        'open_main_menu'           => [
            'uz' => '📋 Asosiy menyu',
            'ru' => '📋 Главное меню',
            'kr' => '📋 Асосий меню',
        ],
        'menu_promotions'          => [
            'uz' => '🎁 Aksiyalar',
            'ru' => '🎁 Акции',
            'kr' => '🎁 Акциялар',
        ],
        'menu_games'               => [
            'uz' => '🎮 O‘yinlar',
            'ru' => '🎮 Игры',
            'kr' => '🎮 Ўйинлар',
        ],
        'menu_news'                => [
            'uz' => '📰 Yangiliklar',
            'ru' => '📰 Новости',
            'kr' => '📰 Янгиликлар',
        ],
        'menu_social'              => [
            'uz' => '🌐 Tarmoqlar',
            'ru' => '🌐 Сети',
            'kr' => '🌐 Тармоқлар',
        ],
        'menu_profile'             => [
            'uz' => '👤 Profil Sozlamalari',
            'ru' => '👤 Настройки профиля',
            'kr' => '👤 Профил Созламалари',
        ],
        'main_menu_title'          => [
            'uz' => "📋 Asosiy menyu. Quyidagilardan birini tanlang:",
            'ru' => "📋 Главное меню. Выберите один из пунктов:",
            'kr' => "📋 Асосий меню. Қуйидагилардан бирини танланг:",
        ],
        'next'                     => [
            'uz' => 'O‘tkazib yuborish',
            'ru' => 'Пропустить',
            'kr' => 'Ўтказиб юбориш',
        ],
        'confirm'                  => [
            'uz' => "✅ Tasdiqlash",
            'ru' => "✅ Подтвердить",
            'kr' => "✅ Тасдиқлаш",
        ],
        // Profile section translations
        'profile_title'            => [
            'uz' => "Shaxsiy ma'lumotlaringiz:",
            'ru' => "Ваши персональные данные:",
            'kr' => "Шахсий маълумотларингиз:",
        ],
        'profile_name'             => [
            'uz' => "Ism",
            'ru' => "Имя",
            'kr' => "Исм",
        ],
        'profile_phone'            => [
            'uz' => "Telefon",
            'ru' => "Телефон",
            'kr' => "Телефон",
        ],
        'profile_phone2'           => [
            'uz' => "Qo‘shimcha tel",
            'ru' => "Доп. номер",
            'kr' => "Қўшимча тел",
        ],
        'profile_region'           => [
            'uz' => "Hudud",
            'ru' => "Регион",
            'kr' => "Ҳудуд",
        ],
        'profile_district'         => [
            'uz' => "Tuman",
            'ru' => "Район",
            'kr' => "Туман",
        ],
        'profile_gender'           => [
            'uz' => "Jinsi",
            'ru' => "Пол",
            'kr' => "Жинси",
        ],
        'profile_birthdate'        => [
            'uz' => "Tug‘ilgan sana",
            'ru' => "Дата рождения",
            'kr' => "Туғилган сана",
        ],
        'profile_lang'             => [
            'uz' => "Tizim tili",
            'ru' => "Язык системы",
            'kr' => "Тизим тили",
        ],
        'profile_update_welcome'   => [
            'uz' => "✏️ Shaxsiy ma'lumotlarni tahrirlash boshlandi",
            'ru' => "✏️ Редактирование личных данных началось",
            'kr' => "✏️ Шахсий маълумотларни таҳрирлаш бошланди",
        ],
        "profile_update_success"   => [
            'uz' => "✅ Shaxsiy ma'lumotlaringiz muvaffaqiyatli yangilandi.",
            'ru' => "✅ Ваши персональные данные успешно обновлены.",
            'kr' => "✅ Шахсий маълумотларингиз муваффақиятли янгиланди.",
        ],
    ];

    public function get($chatId, $key)
    {
        $lang = Cache::store('redis')->get("tg_lang:$chatId", 'uz');
        return $this->messages[$key][$lang] ?? $this->messages[$key]['uz'];
    }
}
